if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"
    # tap "gigalixir/brew"
    tap "hashicorp/tap"

    brew "coreutils"
    # brew "gigalixir"
    brew "mas"
    brew "mysql-client"
    brew "noti"
    brew "terminal-notifier"
    # brew "trash"
    brew "hashicorp/tap/vault"

    # Applications
    cask "1password"
    cask "crossover"
    cask "docker"
    cask "dropbox"
    cask "dungeon-crawl-stone-soup-tiles"
    # cask "google-chrome"
    cask "kitty"
    cask "little-snitch"
    cask "marked" # Previewer for Markdown, MultiMarkdown and other text markup languages
    cask "micro-snitch"
    cask "microsoft-edge"
    cask "slack"
    cask "skype"
    cask "tableplus"
    # cask "imageoptim"
    # cask "notion"
    # cask "hazel"
    # cask "anybar"
    # cask "istat-menus"
    # cask "textbar"
    cask "rocket"
    cask "cleanshot"
    # cask "vmware-fusion"
    # cask "timing"
    cask "choosy"
    cask "soundsource"
    cask "spotify"
    # cask "farrago"
    # cask "loopback"
    # cask "audio-hijack"
    # cask "paw"
    # cask "postman"
    cask "zoom"

    # Browsers
    cask "brave-browser"
    cask "firefox"

    # Fonts
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-3270-nerd-font"

    # macOS App Store
    # mas "Affinity Photo", id: 824183456
    # mas "Affinity Designer", id: 824171161
    # mas "FruitJuice", id: 671736912
    # mas "Drafts", id: 1435957248
    # mas "Airmail", id: 918858936
    # mas "Logic Pro X", id: 634148309
    # mas "Fantastical", id: 975937182
    # mas "Xcode", id: 497799835
    # mas "Reeder", id: 1449412482
    # mas "Final Cut Pro", id: 424389933
    # mas "Deliveries", id: 924726344
    # mas "Shush", id: 496437906
    # mas "Pixelmator Pro", id: 1289583905
    # mas "Magnet", id: 441258766
    # mas "Octotree Pro", id: 1457450145
    # mas "Coca", id: 1000808993
    # mas "MindNode", id: 1289197285
    # mas "ColorSlurp", id: 1287239339
    # mas "Bear", id: 1091189122
    # mas "1Blocker", id: 1107421413
elsif OS.linux?
    brew "xclip"
end

tap "homebrew/bundle"
tap "homebrew/core"
tap "schniz/tap"

# packages
# brew "ack"
brew "autoconf"
brew "asdf"
# brew "bat"
# brew "cloc"
brew "git-delta"
# brew "entr"
# brew "exa"
# brew "fd"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gnupg"
# brew "grep"
# brew "highlight"
# brew "htop"
# brew "jq"
# brew "lazydocker"
# brew "lazygit"
brew "libpq"
# brew "markdown"
# brew "neofetch"
brew "neovim"
brew "oniguruma"
brew "openssl"
# brew "postgresql"
# brew "python"
brew "readline"
brew "ripgrep"
# brew "schniz/tap/fnm"
# brew "shellcheck"
brew "sqlite3"
brew "tmux"
brew "tree"
brew "vim"
# brew "wdiff"
# brew "wget"
brew "wxmac"
brew "xz"
# brew "z"
brew "zlib"
brew "zsh"
